```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.external.git: Refreshing state... [id=-]
module.aws_organization.random_string.random: Refreshing state... [id=si38]
module.serverless_api["example"].module.repository.github_repository.repository: Refreshing state... [id=serverless-example-api]
module.aws_organization.aws_organizations_account.account: Refreshing state...
module.aws_organization.aws_organizations_account.account: Refreshing state... [id=656889719924]
module.aws_logging.data.aws_caller_identity.current: Refreshing state... [id=2020-08-28 03:17:44.814194014 +0000 UTC]
module.aws_logging.data.aws_region.current: Refreshing state... [id=us-east-1]
module.aws_logging.data.aws_partition.current: Refreshing state... [id=2020-08-28 03:17:44.664146091 +0000 UTC]
module.dns.aws_route53_delegation_set.main: Refreshing state... [id=N00248303TX9WWXC3DUAK]
module.dns.module.dns[1].aws_acm_certificate.apex_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/c9310a3b-73b9-4dbb-84df-e87027b2b056]
module.aws_api_gateway.aws_iam_role.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch]
module.dns.module.dns[0].aws_acm_certificate.subdomain_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/3c2dfec3-f3c6-4573-b359-602f45d0ea3f]
module.dns.module.dns[1].aws_acm_certificate.subdomain_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/f9c38627-5deb-4a5e-b2a6-b303c33d32e9]
module.aws_logging.aws_s3_bucket.logs: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.dns.module.dns[0].aws_acm_certificate.apex_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/e4c418a0-8949-4636-8269-a78eb57b72d9]
module.aws_logging.data.aws_iam_policy_document.bucket_policy: Refreshing state... [id=2777606739]
module.aws_logging.aws_kms_key.cloudtrail: Refreshing state... [id=f206c800-14d0-4612-86cd-bd6b80b2045e]
module.aws_api_gateway.aws_api_gateway_account.account: Refreshing state... [id=api-gateway-account]
module.aws_api_gateway.aws_iam_role_policy.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch:default]
module.dns.module.dns[0].aws_route53_zone.zone: Refreshing state... [id=Z09011832P733251NUAHX]
module.dns.module.dns[1].aws_route53_zone.zone: Refreshing state... [id=Z08393103BT7N9U33F6L7]
module.aws_logging.aws_cloudtrail.cloudtrail: Refreshing state... [id=cloudtrail]
module.aws_logging.aws_s3_bucket_public_access_block.logs: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.aws_logging.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.aws_logging.aws_kms_key.cloudtrail will be updated in-place
  ~ resource "aws_kms_key" "cloudtrail" {
        arn                      = "arn:aws:kms:us-east-1:656889719924:key/f206c800-14d0-4612-86cd-bd6b80b2045e"
        customer_master_key_spec = "SYMMETRIC_DEFAULT"
        description              = "cloudtrail"
        enable_key_rotation      = false
        id                       = "f206c800-14d0-4612-86cd-bd6b80b2045e"
        is_enabled               = true
        key_id                   = "f206c800-14d0-4612-86cd-bd6b80b2045e"
        key_usage                = "ENCRYPT_DECRYPT"
      ~ policy                   = jsonencode(
          ~ {
                Id        = "CloudTrail key policy"
              ~ Statement = [
                  ~ {
                        Action    = "kms:*"
                        Effect    = "Allow"
                      ~ Principal = {
                          ~ AWS = [
                                "arn:aws:iam::656889719924:root",
                              - "arn:aws:iam::656889719924:role/BootstrapAccessRole",
                              + "arn:aws:sts::656889719924:role/BootstrapAccessRole",
                            ]
                        }
                        Resource  = "*"
                        Sid       = "Enable IAM User Permissions"
                    },
                    {
                        Action    = "kms:GenerateDataKey*"
                        Condition = {
                            StringLike = {
                                kms:EncryptionContext:aws:cloudtrail:arn = "arn:aws:cloudtrail:*:656889719924:trail/*"
                            }
                        }
                        Effect    = "Allow"
                        Principal = {
                            Service = "cloudtrail.amazonaws.com"
                        }
                        Resource  = "*"
                        Sid       = "Allow CloudTrail to encrypt logs"
                    },
                    {
                        Action    = "kms:DescribeKey"
                        Effect    = "Allow"
                        Principal = {
                            Service = "cloudtrail.amazonaws.com"
                        }
                        Resource  = "*"
                        Sid       = "Allow CloudTrail to describe key"
                    },
                    {
                        Action    = [
                            "kms:Decrypt",
                            "kms:ReEncryptFrom",
                        ]
                        Condition = {
                            StringEquals = {
                                kms:CallerAccount = "656889719924"
                            }
                            StringLike   = {
                                kms:EncryptionContext:aws:cloudtrail:arn = "arn:aws:cloudtrail:*:656889719924:trail/*"
                            }
                        }
                        Effect    = "Allow"
                        Principal = {
                            AWS = "*"
                        }
                        Resource  = "*"
                        Sid       = "Allow principals in the account to decrypt log files"
                    },
                    {
                        Action    = "kms:CreateAlias"
                        Condition = {
                            StringEquals = {
                                kms:CallerAccount = "656889719924"
                                kms:ViaService    = "ec2.us-east-1.amazonaws.com"
                            }
                        }
                        Effect    = "Allow"
                        Principal = {
                            AWS = "*"
                        }
                        Resource  = "*"
                        Sid       = "Allow alias creation during setup"
                    },
                    {
                        Action    = [
                            "kms:Decrypt",
                            "kms:ReEncryptFrom",
                        ]
                        Condition = {
                            StringEquals = {
                                kms:CallerAccount = "656889719924"
                            }
                            StringLike   = {
                                kms:EncryptionContext:aws:cloudtrail:arn = "arn:aws:cloudtrail:*:656889719924:trail/*"
                            }
                        }
                        Effect    = "Allow"
                        Principal = {
                            AWS = "*"
                        }
                        Resource  = "*"
                        Sid       = "Enable cross account log decryption"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        tags                     = {}
    }

  # module.dns.module.dns[0].aws_acm_certificate.apex_wildcard will be created
  + resource "aws_acm_certificate" "apex_wildcard" {
      + arn                       = (known after apply)
      + domain_name               = "scaffoldly.dev"
      + domain_validation_options = [
          + {
              + domain_name           = "scaffoldly.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.dns.module.dns[0].aws_acm_certificate.subdomain_wildcard will be created
  + resource "aws_acm_certificate" "subdomain_wildcard" {
      + arn                       = (known after apply)
      + domain_name               = "*.scaffoldly.dev"
      + domain_validation_options = [
          + {
              + domain_name           = "*.scaffoldly.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.dns.module.dns[0].aws_route53_record.verification_record["scaffoldly.dev"] will be created
  + resource "aws_route53_record" "verification_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z09011832P733251NUAHX"
    }

  # module.dns.module.dns[1].aws_acm_certificate.apex_wildcard will be created
  + resource "aws_acm_certificate" "apex_wildcard" {
      + arn                       = (known after apply)
      + domain_name               = "scaffold.ly"
      + domain_validation_options = [
          + {
              + domain_name           = "scaffold.ly"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.dns.module.dns[1].aws_acm_certificate.subdomain_wildcard will be created
  + resource "aws_acm_certificate" "subdomain_wildcard" {
      + arn                       = (known after apply)
      + domain_name               = "*.scaffold.ly"
      + domain_validation_options = [
          + {
              + domain_name           = "*.scaffold.ly"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.dns.module.dns[1].aws_route53_record.verification_record["scaffold.ly"] will be created
  + resource "aws_route53_record" "verification_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z08393103BT7N9U33F6L7"
    }

Plan: 6 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: planfile

To perform exactly these actions, run the following command to apply:
    terraform apply "planfile"

\n\n0
```